const delay = (s) => new Promise((resolve,rej)=>{
  setTimeout(()=>{
    resolve()
  }, s*1000)
})

const str = `2016.5  幸運地認識了妳
2016.6.10 還記得第一次見到妳，妳躲在岡山捷運的那個角落~
晚上六點在新崛江一起看了魔獸
荒唐的電影，開啟了我們不平凡的戀情，謝謝妳當初的接受

很快地我就變成光頭去當兵了，還記得當初的神德: 我花了十秒觀察到妳女朋友是天然呆對不對 ???

有個笨蛋信誓旦旦保證，老娘住在彰化五年，沒聽過那間醫院，絕對不存在(結果就在旁邊!!!!

還記得剛入伍時，手機沒收，10天後終於可以使用手機，我第一時間居然不是想打給爸爸媽媽哥哥，想都沒想趕快打給蝦大人，
而且還讓妳知道了半夜我有偷偷哭哭著想妳，好幸福的當兵時刻阿...

還記得當初放假去彰化，幫妳從另一間宿舍搬到學校旁的宿舍。
那一天，蟑螂肆虐的一天，尤其是那一隻飛天大蟑螂，搞得我們雞飛狗跳，逼得我們有家歸不得，狼狽地在網咖度過。
真難想像如果那時候妳一個人怎麼辦呢 !?


仔細想想，跟妳在一起最幸福的時候，就是當兵那一年，常常在彰化台中的日子。
那個時候的我，對妳無比的包容，無比的愛，當兵時一直跟妳LINE，下班時，
幫忙著妳弄論文翻譯， 好久好久沒使用的 SKYPE， 一大堆翻譯的對話~
還記得在家裡的時候，用skype通話，聽到妳喊我的時候，我在樓下馬上衝上去並且大喊 蝦大人!!!  好單純好幸福啊...

每次都早早規畫好跟學長學弟們換假，就是為了放連假時趕快衝去彰化找妳，每次放假都想昏了頭的想趕快到彰化。
在彰化的日子，無時無刻膩在一起，真的是無時無刻沒有任何一刻是兩個人不在旁邊的，想想真的好幸福。

還記得當初在彰化時，軒軒喵是個蝦大人的工讀生，負責幫蝦大人簽名，雖然字醜，但是全部字跡一樣就沒問題了，為了申請獎金!!!
還記得在彰化，都是蝦大人騎著噗噗，然後都會使用招牌招式，趴著蹲低往前傾來嚇我，那個時候其實我就覺得妳是危險駕駛了，
但是從後面抱著妳真的好幸福，而且速度也不快所以不怕。
還記得右轉四次，咦~，怎麼彰化這邊有兩間八方雲集我不知道呢??  哈哈哈~
每次必去一中，逢甲，一定會吃的那間關東煮，好好吃，可惜現在不見了...
在彰化的豆腐麵、巧達坊、拉麵、飯菜、轉角總是超級香的炸雞店、妳喜歡去的宿舍附近的冰店，都好懷念呀。

好想念方吉跟泰迪，在彰化的時候他們總是跟妳一起圍繞著我，充滿著幸福感呢。

還記得有次跟穎姿一起去台中，回來的時候，有個傻瓜，因為很累了，拿著鑰匙開錯門，而且還很生氣呢~
還記得，在消防隊，蝦大人來探班，還給了我玉米濃湯，那碗湯真的是我這輩子喝過最美味的湯了。

這段日子，我是多麼無比的包容，而妳是個還沒長大的公主，壞脾氣，但卻也是我人生中最快樂的一段時間。
後來慢慢地我開始變壞，而妳開始變好，慢慢地我也不知道我怎麼了，如果我還是原來那個我，而妳變好了，這樣不知道有多美好


2016.8.16 這是我們交往以來第一次一起過的生日，當時在消防隊的我，積極喬假，為了就是參加蝦大人的壽辰，
還記得這一天我們在逢甲度過呢~ 這也是我人生中第一次跟女朋友一起慶生。


2016.12.31 我們的第一次跨年，在彰化，一大堆警察，然後我還記得台上那個人 掐掐掐掐....



2017.2.3  今天我排假，我們從彰化搭了阿囉哈客運到了台北，因為怕妳暈車，所以找了有沙發可以躺的客運，
當時窮學生...，不然直接搭高鐵就好，辛苦妳了。
跟毛毛還有李一起去了星空草原，很漂亮，有美景又有妳，很幸福快樂。


2017.4.11 這是我們交往以來第一次一起過我的生日，還記得這一天我們在彰化吃西堤呢~
這也是我人生中第一次有人幫我慶生... 覺得好幸福啊


2017.6.10 特別排假去彰化，參加蝦大人一生一次的碩士畢業典禮，沒讀碩士的我，因為有妳才有這個榮幸參加碩士生的畢業典禮呢


2017.8.16 這次的生日在高雄吃著火的牛，吃完後四處走一走~



因為妳害怕跟爸爸相處，所以決定畢業後離開高雄工作，我們一起說好到台北。

2017.8.31 這天是我們出發的日子，妳跟媽咪在左營出發，而我在台南上車，我還記得，那天早上爺爺剛好車禍，我的心情不太好，但是看到妳之後心情就有好起來了
到台北之後，先到了東湖葫洲，住進舅舅的房子，我們三個人在一間小屋子住了幾天，
還記得一起吃了那個不好吃的萬有全，每次騎車經過都會調侃一下呢。
還有那個貴族世家，氣死我們兩個的牛排店，哈哈哈...

我們兩個都無法忍受那個破廁所，很快地積極找房子，蝦大人很棒，找到了南港近捷運的地方。

2017.9.6 我們住進來了，我們的同居生活開始，當兵這一年來我們心心念念的，想著未來同居的事情，想著養姆姆的事情....終於達成一個了

2017.9.7 這天我們跟毛毛還有李一起去 ikea， 挑選椅子，以及一些家具~ 蝦大人很棒，很細心早就觀察家裡桌子的高度，
而可惡的軒軒居然還為此吵了一架，想想真是不應該呀。


很幸運地，一開始在這邊有如水食堂，好吃加上老闆娘人也很好，我們常常去，可惜現在不見了...
一開始蝦大人先找到工作了，Rite !!!! 我還記得第一次面試是在誠品地下，在哪個位置我依然記得清清楚楚，我就躲在角落偷偷看著，可惜現在也不見了...


我很幸運，在學程式的時候其實我好煩躁，但是有妳的支持、鼓勵、陪伴，才有今天我的成就。
後來我也找到工作了，蝦大人平常沒班或者晚班的時候，我總是會在中午偷偷從公司買東西回家一起吃，想起來也是一個小小的幸福呢。
那個時候主管也知道， Sam中午常常回家跟女朋友吃飯，好幸福唷。


2018.12.31 這一天我們打算這次的跨年要不要出去信義區、101跨年，結果前一天我們先去勘查一下地形，發現人潮太可怕了，果斷放棄回家
在家好好看影片就好，滿腔的熱血不見了，真是符合我們兩個性格呢。


2018.1.18 我奶奶去世了，不久後，妳奶奶也走了...真是個不好的巧合，好希望兩位老人家至今健在....


還記得九號貓巷、還記得新北貓咪咖啡廳、永春聞山有貓店......我好喜歡貓咪，妳總會幫我查好然後一起去，窩在貓咪群中，然後妳也在旁邊，好幸福啊...


2018.3.10 今天我們騎著噗噗，從南港大老遠地跑去了十分平溪找我朋友，看瀑布。
還記得妳玩鞭炮，差點玩到出事了呢，想想也是一段好幸福的回憶阿


2018.4.11 謝謝妳偷偷地約了李跟毛，然後我們一起吃飯，並且得到了小蒙牛娃娃~ 妳的驚喜我很開心
在這一天，妳送的鞋子我好喜歡好喜歡，我珍貴的穿著，並不是因為覺得三千很貴。
而是妳的心意，加上鞋子我也好喜歡，所以我非常的珍惜


2018.8.16 我們吃了王朝大酒店的buff，並且送了妳一個妳喜歡的戒指，妳開心，我幸福~



2019.3.2 今天我們突然去參觀黑松世界，拍了一大堆汽水的照片，跟媽媽說我們有出門，不是一直宅在家裡~

2019.4.11 還記得這一年的三月份，妳偷偷買了胖吉跟沖牙機，不過因為妳不會說謊，而且一直很開心，很快地就被我抓包了，然後就早買早享受，
第一次一起使用沖牙機，真的是很棒的東西呢。
妳給我胖吉我也是好開心，現在妳不在了，只剩下胖吉陪我了...


2019.5.25 今天我們跟elle、鳩以私他們一起去看了電影－捍衛任務3，並且晚上一起去做了瘋狂的運動，騎腳踏車好幾個小時呢....


2019.7.20 今天是一起去參加柯老朋友的演唱會，雖然很無聊，但是有妳在的地方，其實也是很幸福...


2019.8.6 那天我們去了大稻埕萬人唱情歌，因為覺得常常吵架，難得想浪漫一下，我主動查詢的行程，想彌補一下我們的感情...


2019.8.16 一個艱苦也幸福的生日，媽咪來台北一起慶生，
非常辛苦地在大太陽下爬了好漢波，去了淡水大學。
一起去了基隆大武崙看海，好多海蟑螂蝦大人好害怕。
一起去了基隆廟口，四處走走四處晃。
有媽咪陪的，很幸福卻也很辛苦疲憊的生日。



2019.9.26 今天的妳去了日本，我內心是非常擔心的，畢竟妳是個小迷糊，幸好有好多好朋友陪妳一起去。
這次的妳也真的是大豐收，柯老的1萬5，我的1萬、以及飛機颱風誤點的理賠 2萬2。
這次的旅行完全沒花錢，而且還是正收入，真不愧是蝦大人呢!
這次的旅行過後，我本來就想說過一年換我跟妳兩個去日本甜蜜蜜....


2019.10.31 今天是柯老的公司正式解散，其實我比妳還不開心呢，畢竟這間公司有好多妳喜歡的人在一起工作。
而且要不是因為柯老解散了...或許現在妳還在我身邊呢....


2019.12.14 這是我們第一次一起到101的日子，在上面，有妳的存在，很開心，很幸福。


2020.1.1 這是我們最後一次的跨年，跨完之後妳就說要先回家陪媽咪，
結果這次一回就回不來了...這個跨完年的第一天，我想我應該會記得一輩子吧...


2020.2.25 這個時候的妳還沒上班，我上班時，妳下午打來了，我們聊一聊，我卻突然爆哭了，
真的是很愛妳，發現妳要走了，不由自主的就嚎啕大哭了起來....

2020.3.8 一起參加雞蛋糕的婚禮，這個時候心想，未來我也可以跟妳擁有一個婚禮，多好...

2020.4.11 這是第一個沒有妳陪的生日，其實好難過，真的好難過...

2020.5.1 我們去了中山，吃了肥前屋，買了爸爸的香港書籍，這是妳來台北，我們一起建築的那個小屋的最後身影。
好希望妳還在這裡，永遠在這裡.........


2020.6.18
今天妳說了，不要再每天連絡通話了，這時候我明白了，真正的明白了，這一晚，我完全沒有睡著，整晚留著眼淚，
過去的種種歷歷在目，哭到早上剛好跟主管出差去桃園。


2020.6.25 端午節
今天我們一起去草衙道，一起吃了之前想去都沒去的貳樓，這一天我一路上其實一直都很想哭，不過都忍住了，怕妳看了不捨得，
最後在捷運站離別的時候，這個時候終於慢慢流淚，站在原地一路看著妳的背影，直到妳上車。



巨人、約定的夢幻島、妳的名字、我們這一家我原本都不會看，因為妳而看了並且我也喜歡。
由其實我們這一家，因為妳~ 妳是專家，100%都看過，但是我應該至少也看了90%了呢~



如水食堂不見了、樓下的轉角雞蛋糕不見了、樓下妳傷心時會去的咖啡廳不見了、回收老人不見了、我的公司吃飯小夥伴本來六個也都不見了、誠品不見了，
不管什麼不見，對我來說都沒關西，可是最終....許之華妳不見了......我真的想都沒想過。

我沒有想過會跟妳分手，但是我有認真思考好幾次我們適不適合的問題。
我知道問題的所在，我也一直都很努力改，到現在我覺得我改變了許多。
我不只一次認真想過，以後跟妳拍漂亮的婚紗，一起步入禮堂，一起養姆姆，一起生小孩...

我真的把妳當我人生中最重要的伴侶，我知道後來的我非常的糟糕，到失去妳之後我才真正地意識到我有多愛妳，非妳不可的那種強烈感覺...
現在的我已經快要恢復到在彰化時的個性了，如果再加上後來妳變好的個性，不知道我們會有多幸福快樂呢...


妳在我的記憶之中，都是美好的~
雖然我們有過多爭吵，大吵大鬧，但是最終，離別的時候，我仔細回味，只有回味到我們過去的幸福模樣~ 謝謝妳


現在，我們就是好朋友，還可以聯絡還可以問候，有任何事情需要幫忙我都可以

非常謝謝妳，這幾年的陪伴，一起過得更好吧~

I LOVE YOU 3000.


謝謝妳的
胖吉 皮卡丘 鋼鐵人杯子 鋼鐵人隨身碟 錢包 鞋子 斜背包 貓咪大浴巾 皮卡丘小浴巾 沖牙機 眼鏡 衣服褲子襪子
每樣東西我都喜歡也很好用~
`



const textList = str.split('\n');

const listLeng = textList.length;

textList.forEach((text, i) => {
  const div = document.createElement("div");
  div.classList.add(`test${i}`);
  if(text === ''){
    div.style.marginTop = '20px'
  }
  document.querySelector("#main").appendChild(div);
});


let isShowAll = false;

function generation(i) {
  const options = {
    strings: [textList[i]],
    typeSpeed: 30,
    showCursor: false,
    onComplete(self){
	if(i+1 >= listLeng){
		isShowAll = true
		return null;
	}

	if(isShowAll){
		showAll();
		return null
	}

      delay(1).then(()=>{generation(i+1)})
    }
  };
  new Typed(`.test${i}`, options);
}


setTimeout(()=>{
	document.querySelector('.startBg').style.opacity = 0.6
}, 500)
setTimeout(()=>{
	document.querySelector('.startBg').style.display = 'none';
	generation(0);
}, 5000)



function showAll(){
  textList.forEach((text, i)=>{
    document.querySelector(`.test${i}`).innerHTML = text
  })
}

document.querySelector('.showAll').addEventListener('click', ()=>{
	isShowAll = true;
})







const imgList = document.querySelectorAll('img.fade');


function fadeImg(count){
	imgList.forEach((img, i)=>{
		img.src = './pjimage' + (count*4 + i+1) + '.jpg'
	})
	setTimeout(()=>{
		fadeImg(count === 4 ? 0 : count + 1)
	}, 3000)
}


fadeImg(0)







function scroll(){
	if(isShowAll) return null
	const mainEle = document.querySelector('#main')
	mainEle.scrollTop = document.querySelector('#main').scrollHeight
	setTimeout(scroll, 1000)
}
scroll()


document.querySelector('body').onclick = () => {
	document.querySelector('audio').play()
}


	const audio = document.querySelector('audio');
	let musicToggle = true;
	audio.addEventListener('ended', (a)=>{
		audio.src = musicToggle ? './我好想妳.mp3' : './突然好想妳.mp3';
		musicToggle = !musicToggle;
	})